Repository: jbl0107/decide-single-mulhacen-2
Catalog: decide/locale/*/LC_MESSAGES/django.po
Languages: de, es

source: We already have the schedule of the days available! Cheer up and attend everyone, they are very interesting
de: Wir haben bereits den Zeitplan der Tage verfügbar! Kopf hoch und besucht alle, sie sind sehr interessant
es: ¡Ya tenemos disponible el horario de las jornadas! Animáos y asistid a todas, son muy interesantes

source: Poster:
es: Cartel:

source: We also leave the promotional poster of the conference.
de: Wir hinterlassen auch das Werbeplakat der Konferenz.
es: También dejamos el cartel de promoción de las jornadas.

source: In addition, you can follow Innosoft Days on social networks:
de: Außerdem können Sie die Innosoft Days in sozialen Netzwerken verfolgen:
es: Además, puedes seguir a Innosoft Days en redes sociales:

source: Translation subsystem
de: Übersetzungssubsystem
es: Subsistema de traducciones

source: Why have we chosen the translation subsystem?
de: Warum haben wir uns für das Übersetzungssubsystem entschieden?
es: ¿Porqué hemos elegido el subsistema de traducciones?

source: Translating a Django application into any language and allowing it to be detected depending on the requests of your users is a very important feature nowadays.
de: Eine Django-Anwendung in eine beliebige Sprache übersetzen und zulassen Erkennung in Abhängigkeit von den Anfragen Ihrer Benutzer ist eine sehr wichtige Funktion heutzutage.
es: Traducir una aplicación en Django a cualquier idioma y permitir que este sea detectado dependiendo de las peticiones de tus usuarios es una característica muy importante hoy en día.

source: In addition, it is very useful to learn to do this since most of the pages that we find on the Internet give you the option of translating them. In this section we will explore a bit how to do it.
de: Darüber hinaus ist es sehr nützlich, dies zu lernen, da die meisten Seiten dies tun die wir im Internet finden, geben Ihnen die Möglichkeit, sie zu übersetzen. Im In diesem Abschnitt werden wir ein wenig untersuchen, wie es geht.
es: Además, es muy útil aprender a hacer esto ya que la mayoría de las páginas es muy útil aprender a hacer esto ya que la mayoría de las páginas que nos encontramos en internet te dan la opción de traducirlas. En esta sección exploraremos un poco cómo hacerlo.

source: To carry out this translation task we needed to have a Django project, which we have used the
de: Um diese Übersetzungsaufgabe auszuführen, brauchten wir ein Django-Projekt, das wir haben die benutzt
es: Para realizar esta tarea de traducciones hemos necesitado tener un proyecto en Django, el cual hemos utilizado el

source: project from the repository provided in the
de: Projekt aus dem Repository, das in der bereitgestellt wird
es: proyecto de <em>decide</em> del repositorio que se nos proporciona en la

source: subject of Evolution and Configuration Management. In addition, we need to have
de: Thema Evolutions- und Konfigurationsmanagement. Außerdem müssen wir haben
es: asignatura de Evolución y Gestión de la Configuración. Además, necesitamostener

source: installed, which is a module that reads the language used by the system and from this
de: installiert, das ist ein Modul, das die vom System verwendete Sprache liest und davon
es: instalado <code>gettext</code> que es un módulo que lee el lengujae que utiliza el sistema y a partir de este

source: loads the corresponding translation file (*.mo) changing the text strings to the system language.
de: lädt die entsprechende Übersetzungsdatei (*.mo) und ändert die Textzeichenfolgen in die Systemsprache.
es: carga el correspondiente archivo de traducción (*.mo) cambiando las cadenas de texto al idioma del sistema.

source: Steps to perform:
de: Schritte durchzuführen
es: Pasos a realizar:

source: Make sure we have translations enabled in our settings. To do this, we need to make the following changes to the
de: Stellen Sie sicher, dass wir Übersetzungen in unseren Einstellungen aktiviert haben. Dazu brauchen wir um die folgenden Änderungen an der vorzunehmen
es: Asegurarnos de que tenemos activadas las traducciones en nuestra configuración. Para hacer esto, debemos hacer los siguientes cambios en el

source: For this case we have defined that our project is by default in
de: Für diesen Fall haben wir definiert, dass unser Projekt standardmäßig in ist
es: Para este caso hemos definido que nuestro proyecto se encuentra por defecto en

source: English
de: Englisch
es: Inglés

source: Once what is indicated in the previous step has been done, we should add the following line
de: Sobald die im vorherigen Schritt angegebenen Schritte ausgeführt wurden, sollten wir die hinzufügen folgende Zeile
es: Una vez hecho lo indicado en el paso anterior, habría que añadir la siguiente línea

source: to the
de: zum
es: en el

source: of our project, it is important Place this middleware between
de: unseres Projekts ist es wichtig, diese Middleware zwischen zu platzieren
es: de nuestro proyecto, es importante ubicar este middleware entre

source: and
de: und
es: y

source: In this case, what we have done is tell Django to use the
de: In diesem Fall haben wir Django angewiesen, die zu verwenden
es: En este caso lo que hemos hecho es indicar a Django que utilice el

source: which will take care of choosing the appropriate language for each user
de: die sich um die Auswahl der geeigneten Sprache für jeden Benutzer kümmert
es: el cual se encargará de escoger el lenguaje adecuado para cada usuario

source: based on information extracted from the request
de: basierend auf Informationen, die aus der Anfrage extrahiert wurden
es: basado en información extraída del request

source: The next step is to
de: Der nächste Schritt ist
es: El siguiente paso es

source: mark the texts that we want to translate
de: Markieren Sie die Texte, die wir übersetzen möchten
es: marcar el texto que queremos traducir

source: within our project, for this there are different ways depending on the text that we are going to translate.
de: innerhalb unseres Projekts, hierfür gibt es je nach Text unterschiedliche Wege die wir übersetzen werden.
es: dentro de nuestro proyecto, para eso hay diferentes formas dependiendo del texto que vamos a traducir.

source: Traduce in templates
de: Traduce in Vorlagen
es: Traducir en templates

source: To explain how to translate templates, suppose we have an index.html in
de: Um zu erklären, wie Templates übersetzt werden, nehmen wir an, wir haben eine index.html in
es: Para explicar cómo traducir templates, supongamos que tenemos un index.html en

source: We need to adapt this file so that it can be translated:
de: Wir müssen diese Datei anpassen, damit sie übersetzt werden kann:
es: Es necesario que adaptemos este archivo para que se pueda traducir:

source: We would have to add the sentence
de: Wir müssten den Satz hinzufügen
es: Habría que añadir la sentencia

source: in each text that we want to translate
de: in jedem Text, den wir übersetzen wollen
es: en cada texto que queramos traducir

source: In addition, in each html that we want to introduce a translation we must include the i18n templatetags with
de: Außerdem müssen wir in jedes HTML, das wir einführen wollen, eine Übersetzung einführen füge die i18n Templatetags mit ein
es: Además, en cada html que queramos introducir una traducción debemosincluir los templatetags de i18n con

source: Later you would have to create a folder called
de: Später müssten Sie einen Ordner namens erstellen
es: Posteriormente habría que crear una carpeta llamada

source: in the path
de: in dem Weg
es: en la ruta

source: Having everything configured, now yes, we proceed to create the translation files. For this we use the following command from the project path:
de: Nachdem alles konfiguriert ist, ja, jetzt fahren wir mit der Erstellung der Übersetzung fort Dateien. Dazu verwenden wir folgenden Befehl aus dem Projektpfad:
es: Teniendo todo configurado, ahora sí, procedemos a crear los archivos de traducción Para esto utilizamos el siguiente comando desde la ruta del proyecto:

source: This will create the translation files for the Spanish language, which is the one we have used for our project
de: Dadurch werden die Übersetzungsdateien für die spanische Sprache erstellt, dh die wir für unser Projekt verwendet haben
es: Esto creará los archivos de traducción para el lenguaje español que es el que hemos utilizado para nuestro proyecto

source: With the commands executed in the previous step, a .po file will be generated in the
de: Mit den im vorherigen Schritt ausgeführten Befehlen wird eine .po-Datei erstellt generiert in der
es: Con los comandos ejecutados en el paso anterior, se nos generará un archivo .po en la

source: folder
de: Mappe
es: carpeta

source: Translate .po files
de: Übersetzen Sie .po-Dateien
es: Traducir archivos .po

source: These files are the ones we will use
de: Diese Dateien werden wir verwenden
es: Estos archivos son los que utilizaremos

source: to specify to Django how to translate each word in a certain language
de: um Django anzugeben, wie jedes Wort in eine bestimmte Sprache übersetzt werden soll
es: para especificarle a Django cómo traducir cada palabra en determinado idioma

source: so simply for each of the strings that appear in
de: so einfach für jede der Saiten, die in vorkommen
es: entonces simplemente para cada uno de los strings que aparezcan en

source: we can specify its translation with strings
de: Wir können seine Übersetzung mit Zeichenfolgen angeben
es: podemos especificar su traducción con los strings

source: Next we proceed to compile the messages created with the previously executed command
de: Als nächstes kompilieren wir die Nachrichten, die mit den zuvor ausgeführten erstellt wurden Befehl
es: A continuación procedemos a compilar los mensajes creados con el comando ejecutado anteriormente

source: Compile translation files
de: Übersetzungsdateien zusammenstellen
es: Compilar archivos de traducción

source: Once we have our complete translation files, we will proceed to compile them with the following command:
de: Sobald wir unsere vollständigen Übersetzungsdateien haben, werden wir mit der Zusammenstellung fortfahren mit folgendem Befehl:
es: Una vez que tengamos nuestros archivos de traducción completos, procederemos a compilarlos con el siguiente comando:

source: When we compile our files,
de: Wenn wir unsere Dateien zusammenstellen,
es: Cuando compilemos nuestros archivos,

source: we are ready to use our project in the specified language
de: Wir sind bereit, unser Projekt in der angegebenen Sprache zu verwenden
es: ya podemos utilizar nuestro proyecto en el idioma especificado

source: Every time one of our users consults our project it will appear in their language. For testing purposes, we can change the language of the project to Spanish and observe the results
de: Jedes Mal, wenn einer unserer Benutzer unser Projekt konsultiert, erscheint es in seinem Sprache. Zu Testzwecken können wir die Sprache des Projekts auf ändern Spanisch und beobachten Sie die Ergebnisse
es: Cada vez que uno de nuestros usuarios consulte nuestro proyecto aparecerá en su idioma. Para efectos de prueba, podemos cambiar el lenguaje del proyecto por spañol y observar los resultados

source: How did we select the language?
de: Wie haben wir die Sprache ausgewählt?
es: ¿Cómo hemos hecho la selección del idioma?

source: For this we have implemented a drop-down html code, which allows us to select the language to which we want to translate and, later, once selected, we must click on a button that says Go which translates the entire html page to the selected language
de: Dafür haben wir einen Dropdown-HTML-Code implementiert, der es uns ermöglicht Wählen Sie die Sprache aus, in die wir übersetzen möchten, und später, sobald Sie sie ausgewählt haben, Wir müssen auf eine Schaltfläche mit der Aufschrift Go klicken, die die gesamte HTML-Seite übersetzt zur ausgewählten Sprache
es: Para ello hemos implementado un código html de un desplegable, que permite seleccionar el idioma al que queremos traducir y, posteriormente una vez seleccionado, hay que darle a un botón que pone Go que traduce toda la página html al idioma seleccionado

source: Things to keep in mind:
de: Dinge zu beachten:
es: Cosas a tener en cuenta:

source: Every time we add an html in our project we must modify the file
de: Jedes Mal, wenn wir unserem Projekt ein HTML hinzufügen, müssen wir die Datei ändern
es: Cada vez que añadimos un html en nuestro proyecto debemos modificar el fichero

source: where we have to add a line like this
de: wo wir eine Zeile wie diese hinzufügen müssen
es: donde tenemos que añadir una línea como esta

source: and also import said view in our file
de: und importieren Sie diese Ansicht auch in unsere Datei
es: y ademas importar dicha vista en nuestro fichero

source: in this way
de: auf diese Weise
es: de esta manera

source: You also have to modify the
de: Sie müssen auch die ändern
es: También hay que modificar el fichero

source: file and add a function for each new html file that you add, this function will contain a line like this:
de: file und fügen Sie eine Funktion für jede neue HTML-Datei hinzu, die Sie hinzufügen, diese Funktion enthält eine Zeile wie diese:
es: y añadir una función por cada fichero html que añadamos nuevo, dicha función tendrá dentro una línea como esta:

source: Voting not started
de: Abstimmung nicht gestartet
es: Votación no empezada

source: Voting in progress
de: Abstimmung läuft
es: Votación en progreso

source: Results:
de: Ergebnisse:
es: Resultados:

source: Option
de: Optionen
es: Opción

source: Puntuation
de: Interpunktion
es: Puntuación

source: Votes
de: Stimmen
es: Votos

source: Let's translate this
de: Lassen Sie uns das übersetzen
es: Vamos a traducir esto

source: Error:
de: Fehler:

source: Command to launch the django console
de: Befehl zum Starten der Django-Konsole
