Repository: jbl0107/decide-single-mulhacen-2
Catalog: decide/locale/*/LC_MESSAGES/django.po
Languages: de, es

source: logout
de: ausloggen
es: Cerrar Sesión

source: Go
de: Gehen
es: Vamos!

source: Username
de: Nutzername
es: Usuario

source: Password
de: Passwort
es: Contraseña

source: Login
de: Anmeldung
es: Inicia sesión

source: Vote
de: Abstimmung
es: Vota

source: Conglatulations. Your vote has been sent
de: Herzlichen Glückwunsch. Ihre Stimme wurde gesendet
es: Enhorabuena. Tu voto ha sido enviado

source: Decide, an educational voting platform
de: Entscheiden, eine pädagogische Abstimmungsplattform
es: Decide, una plataforma de voto educativa

source: Decide is an educational project, designed for the study of voting systems. The project is divided into subsystems, which will be decoupled from each other. Next, a series of aspects about decide will be discussed
de: Decide ist ein Bildungsprojekt, das für das Studium von Wahlsystemen entwickelt wurde. Das Projekt ist in Teilsysteme aufgeteilt, die voneinander entkoppelt werden sonstiges. Als nächstes wird eine Reihe von Aspekten der Entscheidung diskutiert.
es: Decide se trata de un proyecto educativo, pensado para el estudio de sistemas de votación. El proyecto se divide en subsistemas, los cuales estarán desacoplados entre ellos. A continuación se comentarán una serie de aspectos sobre decide.

source: The Gateway
de: Das Tor
es: El Gateway

source: To provide a known entry point for all subsystems exists the so-called gateway that is nothing more than an available route that will redirect all requests to the corresponding subsystem, such that any client using the API doesn't have to know what server it is on deployed each subsystem. The path consists of:
de: Um einen bekannten Einstiegspunkt für alle Subsysteme bereitzustellen, existiert der sogenannte Gateway, das nichts anderes ist als eine verfügbare Route, die alle umleitetAnforderungen an das entsprechende Subsystem, sodass jeder Client, der die API verwendet, muss nicht wissen, auf welchem ​​Server es jedes Subsystem bereitgestellt hat. Der Pfad besteht aus:
es: Para ofrecer un punto de entrada conocido para todos los subsistemas existe el llamado gateway que no es más que una ruta disponible que redirigirá todas las peticiones al subsistema correspondiente, de tal forma que cualquier cliente que use la API no tiene por qué saber en qué servidor está desplegado cada subsistema. La ruta se compone de:

source: Project configuration and execution
de: Projekt konfiguration und -durchführung
es: Configuración y ejecución del proyecto

source: To configure the project, we can create a file local_settings.py based on the local_settings.example.py. Once this is done, you will need install the project dependencies, which are in the file requirements.txt. After this we will have to create our database with postgres. Next, we'll need to perform the first migration with the command
de: Um das Projekt zu konfigurieren, können wir eine Datei local_settings.py erstellen, die auf die local_settings.example.py. Sobald dies erledigt ist, müssen Sie die Projekt abhängigkeiten, die in der Datei requirements.txt stehen. Danach werden wir müssen unsere Datenbank mit Postgres erstellen. Als nächstes müssen wir die erste Migration mit dem Befehl
es: Para configurar el proyecto, podremos crearnos un fichero local_settings.py basado en el local_settings.example.py. Una vez hecho esto, será necesario instalar las dependencias del proyecto, las cuales están en el fichero requirements.txt. Tras esto tendremos que crearnos nuestra base de datos con postgres. A continuación, tendremos que realizar la primera migración con el comando

source: Finally, we will execute the following command to run the server
de: Schließlich führen wir den folgenden Befehl aus, um den Server auszuführen
es: Por último, ejecutaremos el siguiente comando para ejecutar el servidor

source: There is a decide docker configuration ready to be run. This is launch 3 containers, one for the database server, one for the django and another with an nginx web server to serve the static files and proxy django server.
de: Es gibt eine bestimmte Docker-Konfiguration, die ausgeführt werden kann. Dies ist Launch 3 Container, einer für den Datenbankserver, einer für Django und ein weiterer mit ein Nginx-Webserver zum Bereitstellen der statischen Dateien und des Proxy-Django-Servers.
es: Existe una configuración de docker de decide lista para ser ejecutada. Esta lanza 3 contenedores, uno para el servidor de base de datos, otro para el django y otro con un servidor web nginx para servir los ficheros estáticos y hacer de proxy al servidor django.

source: In addition, two volumes are created, one for the static and media files of the project and another for the postgresql database. In this way the containers can be destroyed without fear of losing data. Volumes in question are
de: Außerdem werden zwei Volumes erstellt, eines für die statischen und Mediendateien von das Projekt und ein weiteres für die Postgresql-Datenbank. Auf diese Weise wird das container können ohne Angst vor Datenverlust zerstört werden. In Frage kommende Volumes sind
es: Además se crean dos volúmenes, uno para los ficheros estáticos y medias del proyecto y otro para la base de datos postgresql. De esta forma los contenedores se pueden destruir sin miedo a perder datos. Los volumenes en cuestión son

source: You can edit the docker-settings.py file to modify the settings of the django project before creating the container images.
de: Sie können die Datei docker-settings.py bearbeiten, um die Einstellungen der django-Projekt vor dem Erstellen der Container-Images.
es: Se puede editar el fichero docker-settings.py para modificar el settings del proyecto django antes de crear las imágenes del contenedor.

source: There is a vagrant configuration that creates a virtual machine with everything required installed and ready to go. Configuration is in vagrant/Vagrantfile and by default it uses Virtualbox. To create the virtual machine first we have to find ourselves in the vagrant folder, and then we execute the command
de: Es gibt eine vagabundierende Konfiguration, die eine virtuelle Maschine erstellt mit alles Erforderliche installiert und betriebsbereit. Konfiguration ist in vagrant/Vagrantfile und standardmäßig verwendet es Virtualbox. So erstellen Sie die virtuelle Maschine Zuerst müssen wir uns im Vagabundenordner finden, und dann exekutieren wir der Befehl
es: Existe una configuración de vagrant que crea una máquina virtual con todo lo necesario instalado y listo para funcionar. La configuración está en vagrant/Vagrantfile y por defecto utiliza Virtualbox. Para crear la máquina virtual primero tenemos que encontrarnos en la carpeta vagrant, y posteriormente ejecutamos el comando

source: Once this is done, we can access from the url
de: Sobald dies erledigt ist, können wir über die URL zugreifen
es: Una vez hecho esto, podemos acceder desde la url

source: As the configuration with vagrant is provisioned with ansible, we can use the latter independently to provision an installation of Decide on one or several remote servers with a simple command. Important -> Ansible provisioning is designed to work with ubuntu/bionic64, to work with other distributions it may be necessary modify the packages.yml file.
de: Da die Konfiguration mit Vagrant mit Ansible bereitgestellt wird, können wir Letztere können unabhängig voneinander eine Installation von Entscheiden über einen oder mehrere Remote-Server mit einem einfachen Befehl. Wichtig -> Ansible Bereitstellung ist so konzipiert, dass es mit ubuntu/bionic64 funktioniert, um mit anderen zu arbeiten Distributionen kann es erforderlich sein, die Datei packages.yml zu ändern.
es: Como la configuración con vagrant esta provisionada con ansible, podemos usar esta última de forma independiente para provisionar una instalación de Decide en uno o varios servidores remotos con un simple comando. Importante -> El provisionamiento de ansible está diseñado para funcionar con ubuntu/bionic64, para funcionar con otras distribuciones es posible que haga falta modificar el fichero packages.yml.

source: Versioned
de: Versioniert
es: Versionado

source: API versioning is done using the Django Rest Framework, and the form chosen for this versioning is through search parameters. We can change it to parameters in the URL or in the name of the HOST.
de: Die API-Versionierung erfolgt mit dem Django Rest Framework und dem gewählten Formular für diese Versionierung erfolgt über Suchparameter. Wir können sie ändern in parameter in der URL oder im Namen des HOST.
es: El versionado de API está hecho utilizando Django Rest Framework, y la forma elegida para este versionado es mediante parámetros de búsqueda. Podemos cambiarlo a parámetros en la URL o en el nombre del HOST.

source: Stress test with Locust
de: Stresstest mit Heuschrecke
es: Test de estrés con Locust

source: To run stress tests using locust, we'll need to have it installed. Once installed, we'll need to have a locustfile.py file where we have the configuration of what we are going to execute. Here we have
de: Um Stresstests mit Locust durchzuführen, müssen wir es installiert haben. Einmal installiert, benötigen wir eine locustfile.py-Datei, in der wir die Konfiguration dessen, was wir ausführen werden. Hier haben wir
es: Para ejecutar los test de estrés utilizando locust, necesitaremos tenerlo instalado. Una vez instalado, necesitaremos tener un fichero locustfile.py donde tengamos la configuración de lo que vamos a ejecutar. Aqui tenemos

source: enter the viewer of a vote to see how many requests you can hold. To run the Visualizer test, we have to take into account that enters the vote 'x' (for example, the 1), so we will need have it set up so that it works properly. Once that's done, inside from the loadtest folder we try the following command
de: betreten Sie den Viewer einer Abstimmung, um zu sehen, wie viele Anfragen Sie halten können. Um die Visualizer-Test müssen wir berücksichtigen, dass die Abstimmung 'x' (für Beispiel, die 1), also müssen wir es einrichten, damit es richtig funktioniert. Sobald dies erledigt ist, versuchen wir im Loadtest-Ordner Folgendes: Befehl
es: entra en el visualizador de una votación para ver cuantas peticiones puede aguantar. Para ejecutar el test de Visualizer, tenemos que tener en cuenta que entra en la votación 'x' (por ejemplo, la 1), por lo que necesitaremos tenerla creada para que funcione correctamente. Una vez hecho esto, dentro de la carpeta loadtest probamos el siguiente comando

source: This will open a server that we can see in the browser, the same command it will tell us the port. When it opens, it will ask us how many users we want that they make requests at the same time, and how we want it to grow until get to that number.
de: Dadurch wird ein Server geöffnet, den wir im Browser sehen können, derselbe Befehl ist wird uns den Port mitteilen. Wenn er geöffnet wird, werden wir gefragt, wie viele Benutzer wir wollen dass sie gleichzeitig Anfragen stellen und wie wir wollen, dass es wächst, bis Geh zu dieser Nummer.
es: Esto abrirá un servidor que podremos ver en el navegador, el mismo comando nos dirá el puerto. Cuando se abra, nos preguntará cuantos usuarios queremos que hagan peticiones a la vez, y como queremos que vaya creciendo hasta llegar a ese número.

source: we will use previously created users, and we will do a sequence of requests: login, getuser and store. It would be what a user would do when you are going to vote, so with this example we will be checking how many voting we can do. To run the Voter test, we will need make various preparations. We'll need open 'x' voting, and we will need to create a series of users in the census of this vote, for that when we do the test, these users can authenticate and vote correctly. To make this task easier, we have the python script gen_census.py created. For this script to work, we need to have installed request. After this, we execute the command
de: Wir werden zuvor erstellte Benutzer verwenden und eine Reihe von Anfragen ausführen: login, getuser und store. Das wäre, was ein Benutzer tun würde, wenn Sie es sind abstimmen gehen, also werden wir mit diesem Beispiel überprüfen, wie viele abstimmen wir kann. Um den Voter-Test durchzuführen, müssen wir verschiedene Vorbereitungen treffen. Wir werden müssen 'x' abstimmen öffnen, und wir müssen eine Reihe von Benutzern im Zählung dieser Abstimmung, dafür können diese Benutzer, wenn wir den Test durchführen, authentifizieren und richtig abstimmen. Um diese Aufgabe zu erleichtern, haben wir die Python-Skript gen_census.py erstellt. Damit dieses Skript funktioniert, müssen wir Have Installed Request. Danach führen wir den Befehl aus
es: utilizaremos usuarios previamente creados, y haremos una secuencia de peticiones: login, getuser y store. Sería lo que realizaría un usuario cuando va a votar, por lo que con este ejemplo estaremos comprobando cuantas votaciones podemos hacer. Para ejecutar el test de Voter, necesitaremos realizar varios preparos. Necesitaremos la votación 'x' abierta, y necesitaremos crear una serie de usuarios en el censo de esta votación, para que cuando hagamos el test, estos usuario puedan autenticarse y votar correctamente. Para facilitar esta tarea, tenemos el script de python gen_census.py creado. Para que este script funcione, necesitaremos tener instalado request. Tras esto, ejecutamos el comando

source: After this, we can start the voter stress test
de: Danach können wir den Wählerstresstest starten
es: Tras esto, ya podremos comenzar el test de estrés de votantes

source: The ETS of Computer Engineering
de: Das ETS der Technischen Informatik
es: La E.T.S. de Ingeniería Informática

source: On July 3, 2001, the Governing Council of the Junta de Andalucía approved the creation of the Higher Technical School of Computer Engineering, based in the building of the former Higher Technical School of Industrial Engineers. By then, this school had already finished its move to the new facilities on the Isla de la Cartuja and had vacated the White Building.
de: Am 3. Juli 2001 genehmigte der Regierungsrat der Junta de Andalucía die Gründung der Höheren Technischen Schule für Computertechnik, basierend auf im Gebäude der ehemaligen Höheren Fachschule für Industrie Ingenieure. Bis dahin hatte diese Schule ihren Umzug in das neue bereits abgeschlossen Einrichtungen auf der Isla de la Cartuja und hatte das Weiße Gebäude geräumt.
es: El 3 de julio de 2001, el Consejo de Gobierno de la Junta de Andalucía aprobó la creación de la Escuela Técnica Superior de Ingeniería Informática, con sede en el edificio de la antigua Escuela Técnica Superior de Ingenieros Industriales. Para aquel entonces, esta escuela ya había terminado su mudanza a las nuevas instalaciones en la Isla de la Cartuja y había dejado libre el Edificio Blanco.

source: The Engineering
es: La Ingeniería

source: The 1996/97 academic year was a turning point in the history of computer studies at the University of Seville. The Council of Universities approved the creation of three new degrees: Computer Engineering, Technical Engineering in Management Information Technology and Technical Engineering in Systems Information Technology.
es: El curso académico 1996/97 supuso un punto de inflexión en la historia de los estudios de informática en la Universidad de Sevilla. El Consejo de Universidades aprobó la creación de tres nuevas titulaciones: Ingeniería en Informática, Ingeniería Técnica en Informática de Gestión e Ingeniería Técnica en Informática de Sistemas.

source: The name change implied public acknowledgment that computer science, despite having been born a diploma and set its teeth as a degree, from the beginning had had a marked engineering character, going beyond pure science, applying the knowledge that it it generates the development of techniques, methods and tools with which to solve problems of interest to our society in a practical way and with reasonable costs.
es: El cambio de la denominación suponía el reconocimiento público de que la informática, pese a haber nacido diplomatura y echado los dientes como licenciatura, desde el principio había tenido un marcado carácter de ingeniería, yendo más allá de la pura ciencia, aplicando los conocimientos que ésta genera al desarrollo de técnicas, métodos y herramientas con las que resolver de forma práctica y con unos costes razonables los problemas de interés a nuestra sociedad.

source: The name change also brought with it a significant increase in demand from students finishing high school. For this reason, an important part of the subjects were once again taught in the building of the Higher Technical School of Industrial Engineers, which from then on began to be popularly known as the White Building.
es: El cambio de denominación también llevó consigo un importante incremento en la demanda por parte de los alumnos que terminaban el bachillerato. Por este motivo, una parte importante de las asignaturas volvieron a impartirse en el edificio de la Escuela Técnica Superior de Ingenieros Industriales, que a partir de entonces empezó a ser conocido popularmente como el Edificio Blanco.

source: List of Departments
es: Listado de Departamentos

source: List of Departments that teach at the ETSII:
es: Relación de Departamentos que imparten docencia en la ETSII.

source: Business Administration and Marketing
es: Administración de Empresas y Marketing

source: Human Anatomy and Embryology
es: Anatomía y Embriología Humana

source: Architecture and Technology. of computers
es: Arquitectura y Tecnolog. de Computadores

source: Cell biology
es: Biología Celular

source: Applied Mathematics I
es: Matemática Aplicada I

source: Electronic Technology
es: Tecnología Electrónica

source: Computer Languages ​​and Systems
es: Lenguajes y Sistemas Informáticos

source: Systems Engineering and Automation
es: Ingeniería de Sistemas y Automática

source: Industrial Organization and Business Management.
es: Organización Industrial y Gestión Empr.

source: Mechanics of Continuous Media, Theory of Structures
es: Mecánica de Medios Contínuos, Teoría de Estructuras

source: and many more departments...
es: y muchos departamentos más...

source: Situation
es: Situación

source: The Higher Technical School of Computer Engineering (ETSII) is located on the Reina Mercedes Campus of the University of Seville and is easily accessible by public transport services.
es: La Escuela Técnica Superior de Ingeniería Informática (ETSII) está situada en el Campus de Reina Mercedes de la Universidad de Sevilla y cuenta con un fácil acceso mediante los servicios públicos de transporte.

source: Address
es: Dirección

source: Higher Technical School of Computer Engineering University of Seville
es: Escuela Técnica Superior de Ingeniería Informática Universidad de Sevilla

source: About ETSII:
es: Sobre ETSII:

source: For more information about ETSII:
es: Para más información sobre ETSII:

source: Evolution and Change Management
de: Evolution und Change Management
es: Evolución y gestión de la configuración

source: EGC is a subject from the University of Seville, which belongs to the fourth year of the Computer Software Engineering degree. What it is about and its different sections within it will be detailed below.
de: EGC ist ein Fach der Universität Sevilla, das zum vierten Jahr des Studiengangs Computer Software Engineering gehört. Worum es geht und seinDie verschiedenen Abschnitte darin werden unten detailliert beschrieben.
es: EGC se trata de una asignatura de la Universidad de Sevilla, que pertenece al cuarto año de carrera de Ingeniería informática del Software. A continuación se detallará de qué trata y sus diferentes apartados dentro de ella.

source: Theory topics
de: Theoretische Themen:
es: Temas de teoría

source: It consists of different theory topics that are:
de: Es besteht aus verschiedenen Theoriethemen, die sind:
es: Se compone de diferentes temas de teoría que son:

source: Continuous integration
de: Kontinuierliche Integration
es: Integración continua

source: Software testing
de: Softwaretest
es: Pruebas de software

source: Presentation of the subject
de: Vorstellung des Themas
es: Presentacion de la asignatura

source: Team management
es: Gestión de equipos

source: Source code management
de: Quellcodeverwaltung
es: Gestión del código fuente

source: Incidents and debugging
de: Vorfälle und Debugging
es: Incidencias y depuración

source: Software configurability and software product lines
de: Software-Konfigurierbarkeit und Software-Produktlinien
es: Configurabilidad del software y líneas de producto software

source: DevOps in a complete pipeline
de: DevOps in einer vollständigen Pipeline
es: DevOps en un pipeline completo

source: Innosoft and project management
de: Innosoft und Projektmanagement
es: Innosoft y la gestión de proyectos

source: Subject practices:
de: Betreff Praktiken:
es: Prácticas de la asignatura:

source: Installation of Decide
de: Installation von Decide
es: Instalación de Decide

source: Software Testing
de: Softwaretest
es: Pruebas de Software

source: Source Code Management and Continuous Integration
de: Quellcodeverwaltung und kontinuierliche Integration
es: Gestión de Código Fuente e Integración Continua

source: Application Deployment: Containers
de: Anwendungsbereitstellung: Container
es: Despliegue de aplicaciones: Contenedores

source: Application Deployment: Virtual Machines
de: Anwendungsbereitstellung: Virtuelle Maschinen
es: Despliegue de aplicaciones: Máquinas virtuales

source: For more information on Decide:
de: Weitere Informationen zu Decide:
es: Para más información sobre Decide:

source: Journeys:
de: Arbeitstagen:
es: Jornadas:

source: There are some conferences that are divided into committees for the organization of talks and events, where students participate.
de: Es gibt einige Konferenzen, die in Ausschüsse für die Organisation von Gesprächen unterteilt sindund Veranstaltungen, an denen Studierende teilnehmen.
es: Existen unas jornadas que se dividen en comités para organización de charlas y eventos, donde los alumnos participan.

source: For more information about these journeys:
de: Weitere Informationen zu diesen Sitzungen:
es: Para más información sobre estas jornadas:

source: Journeys
de: Arbeitstagen
es: Jornadas

source: The InnoSoft Days are here: tenth edition!
de: Die InnoSoft Days sind da: zehnte Ausgabe!
es: ¡Ya están aquí las jornadas InnoSoft Days: edición X!

source: The tenth anniversary of these conferences are celebrated on November 8, 10 and 11, 2022 at the Higher Technical School of Computer Engineering (ETSII).
de: Der zehnte Jahrestag dieser Konferenzen wird am 8. und 10. Novembergefeiert und 11. 2022 an der Higher Technical School of Computer Engineering (ETSII).
es: El décimo aniversario de estas jornadas se celebran los días 8, 10 y 11 de noviembre de 2022 en la Escuela Técnica Superior de Ingeniería Informática (ETSII).

source: This year's workshops will have Free Software as their theme. During these days there will be a series of presentations and activities in which you can participate. Do not miss it!
de: Die diesjährigen Workshops haben das Thema Freie Software. Während dieserTage wird es eine Reihe von Präsentationen und Aktivitäten geben, an denen Sie teilnehmen können. Nicht verpassen!
es: Las jornadas de este año tendrán como temática el Software Libre. Durante estos días se desarrollarán una serie de ponencias y actividades en las que podéis participar. ¡No os lo perdáis!

source: Schedule:
de: Zeitlicher Ablauf:
es: Horario:
